Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: Search GdipSetImageAttributesColorKeys in MSDN Library
fr: Consultez GdipSetImageAttributesColorKeys dans la Librairie MSDN.

source: make a range of colors transparent
fr: Définit une page de couleurs transparentes

source: Sets or clears the color- and grayscale-adjustment matrices for a specified category
fr: Définit ou efface les matrices d'ajustement des couleurs - et de niveaux de gris - pour une catégorie déterminée

source: The category for which the color- and grayscale-adjustment matrices are set or cleared:
fr: La catégorie pour laquelle les matrices d'ajustement des couleurs - et de niveaux de gris - sont définies ou effacés:

source: 0 - Color or grayscale adjustment applies to all categories that do not have adjustment settings of their own
fr: 0 - L'ajustement couleur ou niveaux de gris s'applique à toutes les catégories qui n'ont pas leurs propres paramètres de réglage

source: 1 - Color or grayscale adjustment applies to bitmapped images
fr: 1 - L'ajustement couleur ou niveaux de gris s'applique à des images bitmap

source: 2 - Color or grayscale adjustment applies to brush operations in metafiles
fr: 2 - L'ajustement couleur ou niveaux de gris s'applique aux opérations de pinceau dans les métafichiers

source: 3 - Color or grayscale adjustment applies to pen operations in metafiles
fr: 3 - L'ajustement couleur ou niveaux de gris s'applique aux opérations de crayon dans les métafichiers

source: 4 - Color or grayscale adjustment applies to text drawn in metafiles
fr: 4 - L'ajustement couleur ou niveaux de gris s'applique au texte dessiné dans les métafichiers

source: $tagGDIPCOLORMATRIX structure that specifies a color-adjustment matrix
fr: Structure $tagGDIPCOLORMATRIX qui spécifie une matrice d'ajustement des couleurs

source: $tagGDIPCOLORMATRIX structure that specifies a grayscale-adjustment matrix
fr: Structure $tagGDIPCOLORMATRIX qui spécifie une matrice d'ajustement en niveaux de gris

source: Type of image and color that will be affected by the adjustment matrices:
fr: Type d'image et de couleur qui seront concernée par les matrices d'ajustement:

source: 0 - All color values (including grays) are adjusted by the same color-adjustment matrix
fr: 0 - Toutes les valeurs de couleur (y compris les gris) sont ajustées par la même matrice couleur d'ajustement

source: 1 - Colors are adjusted but gray shades are not adjusted.
fr: 1 - Les couleurs sont ajustées mais les nuances de gris ne sont pas ajustées.

source: 2 - Colors are adjusted by one matrix and gray shades are adjusted by another matrix
fr: 2 - Les couleurs sont ajustées par une matrice et les nuances de gris sont ajustées par une autre matrice

source: Search GdipSetImageAttributesColorMatrix in MSDN Library
fr: Consultez GdipSetImageAttributesColorMatrix dans la Librairie MSDN.

source: create the brightness color matrix
fr: Crée la matrice de luminosité des couleurs

source: adjust the image brightness to be 50% brighter
fr: Ajuste la luminosité de l'image à 50 % plus lumineux

source: Release an image object
fr: Libère un objet image

source: Returns enumeration of pixel data attributes contained in an image
fr: Retourne l'énumération des attributs de données de pixels contenus dans une image

source: [0] - Integer flag set of pixel data attributes
fr: [0] - Ensemble de flags entiers d'attributs de données de pixels

source: [1] - String of pixel data attributes separated by delimiter "|"
fr: [1] - Chaîne d'attributs de données de pixel séparées par le délimiteur "|"

source: 10 - Flags cannot be retrieved
fr: 10 - Les flags ne peuvent pas être récupérées

source: 11 - Invalid image handle
fr: 11 - Le handle de l'image est invalide

source: 12 - No pixel data
fr: 12 - Pas de donnée de pixels

source: Use BitAND on returned integer flag set with $GDIP_IMAGEFLAGS_* constants.
fr: Utilisez BitAND sur les flags entiers retournés avec les constantes $GDIP_IMAGEFLAGS_*.

source: Search GdipGetImageFlags in MSDN Library
fr: Consultez GdipGetImageFlags dans la Librairie MSDN.

source: Show enumeration of pixel data attributes for screen capture
fr: Affiche l'énumération des attributs de données de pixels de la capture d'écran

source: Save screen capture bitmap to file
fr: Enregistre le bitmap de la capture d'écran dans un fihier

source: Load screen capture bitmap from file
fr: Charge le bitmap de la capture d'écran à partir du fichier

source: Show enumeration of pixel data attributes for saved file
fr: Affiche l'énumération des attributs de données de pixels du fichier enregistré

source: Get the graphics context of the image
fr: Obtient le contexte graphique de l'image

source: Search GdipGetImageGraphicsContext in MSDN Library
fr: Consultez GdipGetImageGraphicsContext dans la Librairie MSDN.

source: Get the image height
fr: Obtient la hauteur d'une image

source: the image height, in pixels.
fr: Retourne la hauteur de l'image en pixels.

source: Search GdipGetImageHeight in MSDN Library
fr: Consultez GdipGetImageHeight dans la Librairie MSDN.

source: Returns horizontal resolution in DPI (pixels per inch) of an image
fr: Retourne la résolution horizontale en DPI (pixels par pouce) d'une image

source: an integer of DPI (pixels per inch).
fr: Retourne un nombre entier de DPI (pixels par pouce).

source: 10 - DPI cannot be retrieved.
fr: 10 - Le DPI ne peut pas être récupéré.

source: 11 - Invalid image handle.
fr: 11 - Le handle de l'image est invalide.

source: Search GdipGetImageHorizontalResolution in MSDN Library
fr: Consultez GdipGetImageHorizontalResolution dans la Librairie MSDN.

source: Show horizontal resolution in DPI (dots per inch) of image
fr: Affiche la résolution horizontale en DPI (points par pouce) de l'image

source: Returns pixel format of an image:Bits per pixel, Alpha channels, RGB, Grayscale, Indexed etc
fr: Retourne le format des pixels d'une image: bits par pixel, les canaux alpha et RVB, niveaux de gris, indexés, etc.

source: [0] - Integer of pixel format constant
fr: [0] - Constante du format de pixel

source: [1] - String of pixel format
fr: [1] - Chaîne de format de pixel

source: 10 - Invalid pixel format.
fr: 10 - Le format de pixel est invalide.

source: 12 - Unknown pixel format.
fr: 12 - Le format de pixel est inconnu.

source: Search GdipGetImagePixelFormat in MSDN Library
fr: Consultez GdipGetImagePixelFormat dans la Librairie MSDN.

source: Show pixel format for screen capture
fr: Affiche le format de pixel pour la capture d'écran

source: Show pixel format for saved file
fr: Affiche le format de pixel du fichier sauvegardé

source: Returns file format GUID and image format name of an image
fr: Retourne, pour une image, le GUID du format de fichier et le nom du format d'image

source: [0] - String of file format GUID
fr: [0] - Chaîne contenant le GUID du format de fichier

source: [1] - String of image format name
fr: [1] - Chaîne contenant le nom du format de l'image

source: 10 - Invalid raw format.
fr: 10 - Format raw invalide.

source: 12 - Invalid file format GUID.
fr: 12 - GUID du format de fichier invalide.

source: 13 - Unknown file format GUID.
fr: 13 - GUID du format de fichier inconnu.

source: Search GdipGetImageRawFormat in MSDN Library
fr: Consultez GdipGetImageRawFormat dans la Librairie MSDN.

source: Show image format for screen capture
fr: Affiche le format d'image pour la capture d'écran

source: Show image format for saved file
fr: Affiche le format d'image pour le fichier sauvegardé

source: Returns type (bitmap or metafile) of an image
fr: Retourne le type (bitmap ou métafichier) d'une image

source: an integer of image type:
fr: Retourne un entier représentant le type d'image:

source: $GDIP_IMAGETYPE_UNKNOWN - Non bitmap file or not identified as bitmap by GDI+
fr: $GDIP_IMAGETYPE_UNKNOWN - Fichier non bitmap ou non identifié comme bitmap par GDI+

source: $GDIP_IMAGETYPE_BITMAP - Bitmap types:
fr: $GDIP_IMAGETYPE_BITMAP - Types de bitmap:

source: $GDIP_IMAGETYPE_METAFILE - Metafile types:
fr: $GDIP_IMAGETYPE_METAFILE - Types de métafichier:

source: 10 - Invalid image type.
fr: 10 - Type d'image invalide.

source: Search GdipGetImageType in MSDN Library
fr: Consultez GdipGetImageType dans la Librairie MSDN.

source: Show image type:
fr: Voir le type d'image :

source: Returns vertical resolution in DPI (pixels per inch) of an image
fr: Retourne la résolution verticale en DPI (pixels par pouce) d'une image

source: 11 - Invalid DPI.
fr: 11 - DPI invalide.

source: 10 - Invalid image handle.
fr: 10 - Handle de l'image invalide.

source: Search GdipGetImageVerticalResolution in MSDN Library
fr: Consultez GdipGetImageVerticalResolution dans la Librairie MSDN.

source: Show vertical resolution in DPI (dots per inch) of image
fr: Affiche résolution verticale en DPI (points par pouce) de l'image

source: Get the image width
fr: Obtient la largeur de l'image

source: an image width, in pixels.
fr: Retourne la largeur de l'image en pixels.

source: Search GdipGetImageWidth in MSDN Library
fr: Consultez GdipGetImageWidth dans la Librairie MSDN.

source: Create an image object based on a file
fr: Crée un objet image à partir d'un fichier

source: Fully qualified image file name
fr: Nom complet (avec le chemin) du fichier image

source: a handle to the new image object.
fr: Retourne le handle du nouvel objet image.

source: Search GdipLoadImageFromFile in MSDN Library
fr: Consultez GdipLoadImageFromFile dans la Librairie MSDN.

source: Screen Capture
fr: Capture d'écran

source: Get JPEG encoder CLSID
fr: Obtient le CLSID de l'encodeur JPEG

source: Set up parameters for 90 degree rotation
fr: Met en place des paramètres pour la rotation de 90 degrés

source: Save image with rotation
fr: Enregistre l'image résultat de la rotation

source: Creates an Image object based on a stream
fr: Crée un objet Image à partir d'un flux

source: Pointer to an IStream interface
fr: Handle de l'interface IStream

source: a pointer to a new Image object.
fr: Retourne le handle de l'objet Image.

source: Search GdipLoadImageFromStream in MSDN Library
fr: Consultez GdipLoadImageFromStream dans la Librairie MSDN.

source: Resize an image to a new given size
fr: Redimensionne une image à une taille donnée

source: A handle value
fr: Handle de l'image

source: An integer value
fr: La nouvelle largeur (nombre entier)

source: An integer value.
fr: Le mode d'interpolation (nombre entier).

source: Default is $GDIP_INTERPOLATIONMODE_HIGHQUALITYBICUBIC.
fr: Par défaut, $GDIP_INTERPOLATIONMODE_HIGHQUALITYBICUBIC.

source: a handle to a new Bitmap object
fr: Retourne le handle du nouvel objet Bitmap

source: 1 - unable to create new bitmap
fr: 1 - Impossible de créer un nouveau bitmap

source: 2 - unable to create graphics context
fr: 2 - Impossible de créer le contexte graphique

source: 3 - unable to set interpolation mode on graphics context
fr: 3 - Impossible de régler le mode d'interpolation sur le contexte graphique

source: 4 - unable to copy image to scaled bitmap
fr: 4 - Impossible de copier l'image dans le bitmap redimensionné

source: create a GDI bitmap by capturing full screen of the desktop
fr: Crée un bitmap GDI en capturant le bureau en entier

source: resize image
fr: Redimensionne l'image

source: create a test gui to display the resized image
fr: Crée une GUI de test pour afficher l'image redimensionnée

source: display scaled image
fr: Affiche l'image redimensionnée

source: Rotates and flips an image
fr: Applique des rotations et des symétries à une image

source: Type of rotation and flip:
fr: Type de rotation et symétrie:

source: 0 - No rotation and no flipping (A 180-degree rotation, a horizontal flip and then a vertical flip)
fr: 0 - Pas de rotation et pas de symétrie (rotation de 180 degrés, symétrie horizontale puis symétrie verticale)

source: 1 - A 90-degree rotation without flipping (A 270-degree rotation, a horizontal flip and then a vertical flip)
fr: 1 - Une rotation de 90 degrés sans symétrie (rotation de 270 degrés, symétrie horizontale puis symétrie verticale)

source: 2 - A 180-degree rotation without flipping (No rotation, a horizontal flip followed by a vertical flip)
fr: 2 - Une rotation de 180 degrés sans symétrie (pas de rotation, une symétrie horizontale suivie d'une symétrie verticale)

source: 3 - A 270-degree rotation without flipping (A 90-degree rotation, a horizontal flip and then a vertical flip)
fr: 3 - Une rotation de 270 degrés sans symétrie (rotation de 90 degrés, symétrie horizontale puis symétrie verticale)

source: 4 - No rotation and a horizontal flip (A 180-degree rotation followed by a vertical flip)
fr: 4 - Pas de rotation et une symétrie horizontale (rotation de 180 degrés suivie d'une symétrie verticale)

source: 5 - A 90-degree rotation followed by a horizontal flip (A 270-degree rotation followed by a vertical flip)
fr: 5 - Une rotation de 90 degrés suivie d'une symétrie horizontale (une rotation de 270 degrés suivie d'une symétrie verticale)

source: 6 - A 180-degree rotation followed by a horizontal flip (No rotation and a vertical flip)
fr: 6 - Une rotation de 180 degrés suivie d'une symétrie horizontale (pas de rotation et une symétrie verticale)

source: 7 - A 270-degree rotation followed by a horizontal flip (A 90-degree rotation followed by a vertical flip)
fr: 7 - Une rotation de 270 degrés suivie d'une symétrie horizontale (rotation de 90 degrés suivie d'une symétrie verticale )

source: Search GdipImageRotateFlip in MSDN Library
fr: Consultez GdipImageRotateFlip dans la Librairie MSDN.

source: rotate image by 90 degrees without flipping
fr: Fait pivoter l'image de 90 degrés sans retournement

source: create a test gui to display the rotated image
fr: Crée une GUI de test pour afficher l'image pivotée

source: display rotated image
fr: Affiche l'image pivotée

source: Save an image to file
fr: Enregistre une image à déposer

source: Search GdipSaveImageToFile in MSDN Library
fr: Consultez GdipSaveImageToFile dans la Librairie MSDN.

source: Pointer to a $tagGDIPENCODERPARAMS structure
fr: Pointeur sur une structure $tagGDIPENCODERPARAMS

source: Capture screen
fr: Capture l'écran

source: Saves an Image object to a stream
fr: Enregistre un objet Image dans un flux

source: Pointer to a $tagGUID structure that defines the image encoder GUID
fr: Pointeur sur une structure $tagGUID qui définit le GUID de l'encodeur de l'image

source: Use this function to save selected frames from a multiple-frame image to another multiple-frame image.
fr: Utilisez cette fonction pour enregistrer des trames sélectionnées à partir d'une image à trames multiples vers une autre image à trames multiples.

source: Search GdipSaveImageToStream in MSDN Library
fr: Consultez GdipSaveImageToStream dans la Librairie MSDN.

source: Scales an image by a given factor
fr: Change les échelles horizontale et verticale d'une image

source: A floating point value
fr: Une valeur à virgule flottante: échelle horizontale

source: Returns a handle to a new Bitmap object
fr: Retourne le handle du nouvel objet Bitmap

source: 1 - unable to get width of image
fr: 1 - Impossible d'obtenir la largeur de l'image

source: 2 - unable to get height of image
fr: 2 - Impossible d'obtenir la hauteur de l'image

source: 3 - unable to create new bitmap
fr: 3 - Impossible de créer un nouveau bitmap

source: 4 - unable to create graphics context
fr: 4 - Impossible de créer le contexte graphique

source: 5 - unable to set interpolation mode on graphics context
fr: 5 - Impossible de définir le mode d'interpolation sur le contexte graphique

source: 6 - unable to copy image to scaled bitmap
fr: 6 - Impossible de copier l'image dans le bitmap mis à l'échelle

source: Scale factor greater than 1 means enlarging the image whereas smaller than 1 means decrease the size.
fr: Un facteur d'échelle supérieur à 1 signifie un agrandissement de l'image alors que plus petit que 1 signifie une diminution de la taille.

source: create a GDI bitmap by capturing 1/16 of desktop
fr: Crée un bitmap GDI en capturant un seizième de bureau

source: 1.0 is without any scaling
fr: 1.0 est sans redimensionnement

source: scale image by 275% (magnify)
fr: Image à l'échelle de 275% (agrandissement)

source: Creates a LinearGradientBrush object from a set of boundary points and boundary colors
fr: Crée un pinceau à dégradé linéaire à partir de deux points frontières et de deux couleurs limites

source: X coordinate of the starting point of the gradient.
fr: Coordonnée X du point de début du dégradé.

source: The starting boundary line passes through the
fr: La ligne frontière démarre en passant par ce point

source: Y coordinate of the starting point of the gradient.
fr: Coordonnée Y du point de début du dégradé.

source: X coordinate of the ending point of the gradient.
fr: Coordonnée X du point de fin du dégradé.

source: The ending boundary line passes through the
fr: La ligne frontière termine en passant par ce point

source: Y coordinate of the ending point of the gradient.
fr: Coordonnée Y du point de fin du dégradé.

source: Alpha, Red, Green and Blue components of the starting color of the line
fr: Composantes Alpha, Rouge, Vert et Bleu de la couleur de la ligne de début

source: Alpha, Red, Green and Blue components of the ending color of the line
fr: Composantes Alpha, Rouge, Vert et Bleu de la couleur de la ligne de fin

source: Wrap mode that specifies how areas filled with the brush are tiled:
fr: Indique comment un dégradé est disposé en mosaïque lorsqu'il est plus petit que la zone à remplir:

source: 0 - Tiling without flipping
fr: 0 - Dispose le dégradé en mosaïque, sans symétrie

source: 1 - Tiles are flipped horizontally as you move from one tile to the next in a row
fr: 1 - Retourne le dégradé horizontalement, puis le dispose en mosaïque

source: 2 - Tiles are flipped vertically as you move from one tile to the next in a column
fr: 2 - Retourne le dégradé verticalement, puis le dispose en mosaïque

source: 3 - Tiles are flipped horizontally as you move along a row and flipped vertically as you move along a column
fr: 3 - Retourne le dégradé horizontalement et verticalement, puis le dispose en mosaïque

source: 4 - No tiling takes place
fr: 4 - Le dégradé n'est pas disposé en mosaïque

source: a pointer to a new LinearGradientBrush object.
fr: Retourne le handle du nouvel objet LinearGradientBrush.

source: After you are done with the object, call _GDIPlus_BrushDispose() to release the object resources.
fr: Lorsque vous en avez terminé avec l'objet, appelez _GDIPlus_BrushDispose() pour libérer les ressources de l'objet.

source: Search GdipCreateLineBrush in MSDN Library
fr: Consultez GdipCreateLineBrush dans la Librairie MSDN.

source: create linear gradient brush
fr: Crée un pinceau à dégradé linéaire

source: draw the egg
fr: Dessine l'oeuf

source: Creates a LinearGradientBrush object from a rectangle and boundary colors
fr: Crée un pinceau à dégradé linéaire sur la base d'un rectangle, des couleurs de début et de fin, et de l'orientation

source: $tagGDIPRECTF that specifies the starting and ending points of the gradient
fr: Structure $tagGDIPRECTF qui spécifie les points de début et de fin du dégradé

source: The direction of the gradient:
fr: La direction du dégradé:

source: 0 - Horizontal direction from the left of the display to the right of the display
fr: 0 - Direction horizontale de la gauche de l'écran vers la droite de l'écran,

source: 1 - Vertical direction from the top of the display to the bottom of the display
fr: 1 - Direction verticale depuis le haut de l'écran vers le bas de l'écran

source: 2 - Forward diagonal direction from the upper-left corner to the lower-right corner of the display
fr: 2 - Direction vers l'avant en diagonale à partir du coin supérieur gauche au coin inférieur droit de l'écran

source: 3 - Backward diagonal direction from the upper-right corner to the lower-left corner of the display
fr: 3 - Direction vers l'arrière en diagonale à partir du coin supérieur droit vers le coin inférieur gauche de l'écran

source: Specifies how areas filled with the brush are tiled:
fr: Indique comment un dégradé est disposé en mosaïque lorsqu'il est plus petit que la zone à remplir:

source: Search GdipCreateLineBrushFromRect in MSDN Library
fr: Consultez GdipCreateLineBrushFromRect dans la Librairie MSDN.

source: Creates a LinearGradientBrush object from a rectangle, boundary colors and angle of direction
fr: Crée un pinceau à dégradé linéaire à partir d'un rectangle, de deux couleurs limites et d'un angle de direction

source: Depending the value of $fIsAngleScalable, this is the angle, in degrees (see remarks)
fr: Angle, mesuré en degrés dans le sens des aiguilles d'une montre à partir de l'axe x, de la direction du dégradé (voir Remarques)

source: If True, the angle of the directional line is scalable.Not scalable otherwise
fr: Affectez la valeur true afin de spécifier que l'angle est touché par la transformation associée à ce LinearGradientBrush; sinon, false.

source: If $fIsAngleScalable is True, $iAngle specifies the base angle from which the angle of the directional line is calculated.
fr: Si $fIsAngleScalable est True, $iAngle spécifie l'angle de base à partir duquel l'angle de la direction de la ligne est calculé.

source: Otherwise, $iAngle specifies the angle of the directional line.
fr: Sinon, $iAngle spécifie l'angle de la direction de la ligne.

source: The angle is measured from the top of the rectangle and must be in degrees.
fr: L'angle est mesuré à partir de la partie supérieure du rectangle et doit être en degrés.

source: The gradient follows the directional line.
fr: Le dégradé suit la ligne directionnelle.

source: Search GdipCreateLineBrushFromRectWithAngle in MSDN Library
fr: Consultez GdipCreateLineBrushFromRectWithAngle dans la Librairie MSDN.

source: Gets the starting color and ending color of a linear gradient brush
fr: Obtient la couleur de début et la couleur de fin d'un pinceau à dégradé linéaire

source: Pointer to a LinearGradientBrush object
fr: Handle de l'objet LinearGradientBrush

source: an array containing the starting and ending colors of the LinearGradientBrush:
fr: Retourne un tableau contenant les couleurs de début et de fin de l'objet LinearGradientBrush:

source: [0] - Starting color
fr: [0] - Couleur de début

source: [1] - Ending color
fr: [1] - Couleur de fin

source: sets the @error flag to non-zero, @extended may contain GPSTATUS error code error code ($GPID_ERR*).
fr: Retourne @error <> 0, @extended contient le code erreur GPSTATUS ($GPID_ERR*).

source: Search GdipGetLineColors in MSDN Library
fr: Consultez GdipGetLineColors dans la Librairie MSDN.

source: $fBGColor format RRGGBB
fr: $fBGColor est au format RRGGBB

source: create linear gradient flipped brush
fr: Crée un pinceau à dégradé linéaire renversé

source: clear bitmap
fr: Efface le bitmap

source: draw the egg again
fr: Dessine de nouveau l'œuf

source: Gets the rectangle that defines the boundaries of a linear gradient brush
fr: Obtient le rectangle qui définit les frontières d'un pinceau à dégradé linéaire

source: an array containing the rectangle boundaries:
fr: Retourne un tableau contenant les frontières du rectangle :

source: [0] - X coordinate of the upper-left corner of the rectangle
fr: [0] - Coordonnée X du coin supérieur gauche du rectangle

source: [1] - Y coordinate of the upper-left corner of the rectangle
fr: [1] - Coordonnée Y du coin supérieur gauche du rectangle

source: [2] - Width of the rectangle
fr: [2] - Largeur du rectangle

source: [3] - Height of the rectangle
fr: [3] - Hauteur du rectangle

source: Search GdipGetLineRect in MSDN Library
fr: Consultez GdipGetLineRect dans la Librairie MSDN.
